//;******************************************************************************
//;* Copyright (c) 2020, Insyde Software Corporation. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//;
//; Module Name:
//;
//;   SysPasswordDxeStr.uni
//;
//; Abstract:
//;
//;   String definitions for SysPassword
//;

/=#

#langdef en-US "English"
#langdef fr-FR "Français"


#string STR_WARNING                     #language en-US        "Supervisor Password is not set!!! Press enter to set supervisor password\n"
                                                                                
#string STR_INPUT_SYS_PASSWORD          #language en-US        "Please input supervisor password"

#string STR_CONFIRM_SYS_PASSWORD        #language en-US        "Please input again to confirm"

#string STR_CONFIRM_INCORRECT_SYS_PASSWORD          #language en-US        "Incorrect password! Please input again!"
#string STR_SYS_DIALOG_THREE_ERRORS     #language en-US        "Input wrong password 3 times"
#string STR_SYS_DIALOG_HALT             #language en-US        "SYSTEM HALT"
                                        